{
    "Title": "Tłumaczenie demo",
    "WelcomeMessage": "czesc",
    "Contact": "Kontakt",

    "HowLearnNET_1":"Jak się uczyć się .NET i C# (<i>CSharp</i>)",
    "HowLearnNET_2":"Jak zostać profesjonalnym programistą .NET",
    "HowLearnNET_3":"Jak się uczyć programowania?",
    "HowLearnNET_4":" Jeśli trafiłeś na tą stronę to zakładam, że jesteś osobą zainteresowaną nauką .NET i języka C#. Dlatego w tym materiale będę chciał opowiedzieć jak uczyć się w taki sposób aby relatywnie szybko zostać profesjonalnym programistą (<i>rozpocząć pracę jako programista</i>).",
    "HowLearnNET_5":"Najpierw spróbujmy określić co zdecyduje o tym, że będziesz programistą. To pozwoli tobie kłaść nacisk na sprawy istotne.",
    "HowLearnNET_6":"Do wyboru masz kilka możliwości lub miks tych możliwości:",
    "HowLearnNET_7":"[1] Studia informatyczne <br>[2] Stacjonarny kurs programowania <br>[3] Indywidualna nauka <br>[4] Praktyka w firmie<br>", 
    "HowLearnNET_8":"Hmmm... jest tego trochę. No i teraz co wybrać? Bo przecież każda decyzja to koszt finansowy i czasowy. Dlatego przedstawię tobie moje przemyślenia odnośnie tej sprawy, które są moją subiektywną opinnią ale mogą pomóc wejść w zawód programisty.",
    "HowLearnNET_9":"Na początku odrzucę punkt związany z studiami informatycznymi. W Polsce mamy taki pogląd, że posiadanie wykształcenia wyższego jest pewnym obowiązkiem, być może tak jest w pewnych zawodach. Jednak jeśli chodzi o programowanie to nie są wymagane. Bardzo rzadko firmy stawiają wymóg posiadania wykształcenia wyższego zatrudniając programistę. A o kwalifikacji kandydata do pracy decyduje poziom jego wiedzy technicznej na temat danej technologii. Dodatkowo studia trwają kilka dobrych lat na których uczone są rzeczy nie koniecznie przydatne do bycia programistą. Dlatego jeśli twoim celem jest dostać pracę młodszego programisty za około 1.5 roku od rozpoczęcia intensywnej nauki to studia będą ci nie po drodze.",
    "HowLearnNET_10":"Następnie spójrzmy na stacjonarne kursy programowania, które obiecują że zrobią z każdego programistę średnio w około 1 miesiąc. Koszt takiego kursu waha się w granicach od 3 000 zł do 10 000 zł. Taki kurs to dobra sprawa, gdyż daje możliwość poznania aspektów programowania w dość intensywnym trybie.<b> Ale uwaga!</b> grzechem tych firm jest to, że obiecują, zrobić z każdego programistę w 1 miesiąc. Przez to wypaczają pogląd i sposób podejścia kursantów do sprawy (<i>no ale takie są zasady każdej reklamy</i>). Taki kursant ma fałszywą obietnicę, że zapłacenie i odbycie kursu daje mu bilet do pracy profesjonalnego programisty - co jest oczywiście błędnym przekonaniem. Kurs poprostu o tym nie zdecyduje.",
    "HowLearnNET_11":"No dobrze to co w takim razie decyduje o tym czy uda mi się zostać programistą? Dobre pytanie, na które trzeba dobrze odpowiedzieć jeśli chcę dostać się do tego zawodu. Dlatego spróbujmy to naświetlić tak jak ta spraw wygląda.",
    "HowLearnNET_12":"Przedewszystkim nauka programowania jest procesem dość żmudnym zwłaszcza na początku. Dlatego nie obejdzie się bez samodzielnej nauki. <b> Należy postarać się aby jakość i intensywność tej nauki był wysoka, gdyż właśnie ten aspekt będzie najbardziej decydujący.</b> Materiały i narzędzia do nauki są dostępne w Internecie za darmo lub odpłatnie, jednak koszt ich jest stosunkowo niewielki porównując koszty z kursem stacjonarnym lub studiami. Cała nauka indywidualna może być w miejscu w którym się znajdujesz i dzięki temu odchodzą koszty czasowe i finansowe związane z dojazdami lub przebywaniem w innej miejscowości. Na chwilę obecną nie ma takiej technologii aby wiedzę wgrać bezpośrednio do głowy, dlatego wysiłek związany z indywidualną nauką cię nie ominie, jednak możesz sobie umilać naukę pijąc dobrą kawę :) lub wybierając się na jakiś kurs lub darmowy programistyczny event gdzie można posłuchać o sprawach technicznych i porozmawiać z ludźmi.",
    "HowLearnNET_13":"Indywidualna nauka to już jest dużo, jednak należy do tego dodać coś jeszcze (zrobić miks). To coś jeszcze to praca blisko kogoś kto jest doświadczonym programistą. I tutaj można to osiągnąć poprzez dostanie się na praktykę, gdzie będziemy mieli możliwość pracować blisko programistów. Taka praktyka daje zrozumienie pewnych praktycznych aspektów programowania, których nie da nam indywidualna nauka.",
    "HowLearnNET_14":"Podsumowując jeśli celujemy w to aby w niedługim czasie zostać profesjonalnym programistą to zdecyduje o tym <b>indywidualna nauka</b> plus <b>paromiesięczna praktyka</b> u boku doświadczonego programisty. Studia lub kursy są pomocne ale jako dodatek do wyżej opisanych aspektów.",
    "HowLearnNET_15":"Czego się uczyć i jak?",
    "HowLearnNET_16":"Jeśli już zdecydujemy się na samodzielną naukę to powinniśmy określić:",
    "HowLearnNET_17":"[1] czego się uczyć <br> [2] jak się uczyć <br> [3] jakie wybrać materiały",
    "HowLearnNET_18":"Czego się uczyć? Odpowiedź jest .NET i C# hmmm... ale to nie wystarczająca odpowiedź. Przecież gdy zaczniemy pracę to sama znajomość C# nie wystarczy, gdyż aplikacje korporacyjne są złożone z różnych komponentów, praca nad rozwojem aplikacji też nie odbywa się w próżni a w pewnym środowisku gdzie obowiązują pewne zasady i narzędzia.",
    "HowLearnNET_19":"Spróbujmy określić to czego należy nauczyć się jako podstawowe minimum aby poradzić na rozmowie kwalifikacyjnej i w pierwszych miesiącach pracy. Naukę powinno się zaplanować kilko torowo aby pokryć następujące obszary:",
    "HowLearnNET_20":"[1] składnia języka c# (<i>C-Sharp</i>) <br> [2] główne biblioteki .NET (<i>dot net</i>) <br> [3] podstawy pracy z bazami danych (<i> MS SQL Server lub Oracle</i>) <br> [4] narzędzie do pracy z kodem GIT lub SVN <br>",
    "HowLearnNET_21":"opanowanie ww. zagadnień są podstawą do rozpoczęcia pracy. Dodatkowo warto je rozszerzyć o zagadnienia frontendowe czyli JavaScript, jQuery lub AnguarJS gdyż coraz więcej aplikacji korporacyjnych tworzy się w technologii webowej.",
    "HowLearnNET_22":"Przejdźmy teraz do tego jak się uczyć wyżej wymienionych zagadnień i dobrać materiały. <b>Naszym celem powinno być poznanie aspektów programowania w sposób praktyczny.</b> Dobrze to brzmi ale co to dokładnie znaczy? Spróbujmy na to odpowiedzieć. Gdy rozpoczniesz pracę komercyjną będą przed tobą stawiane problemy opisywane przez analityków lub użytkowników w różny sposób a twoim zadaniem będzie zrozumienie to o co im chodzi i przełożenie na język zrozumiały dla maszyn. Innymi słowy będziesz musiał tłumaczyć opisy \"słowno-muzyczne\" na kod i rozwiązania. Dodatkowo będziesz osadzony w pewnym środowisku składającym się z narzędzi, aplikacji i rozwiązań które mają pomiędzy sobą wiele zależności.<b> Aby sobie z tym wszystkim poradzić twoja nauka powinna być ukierunkowana na zrozumienie poszczególnych aspektów programowania.</b> Innymi słowy powinieneś się uczyć w taki sposób aby rozumieć jak coś działa i do czego jest to potrzebne.",
    "HowLearnNET_23":"Dlatego materiały do nauki powinny być tak dobrane aby:",
    "HowLearnNET_24":"[1] wyjaśniały zagadnienia <br> [2] pokazywały przykłady <br> [3] opowiedziały do czego praktycznie to jest używane <br> [4] zawierały ćwiczenia w formie zadań praktycznych* <br> [5] oferowały możliwość weryfikacji czy zadanie zostało dobrze rozwiązane",
    "HowLearnNET_25":"<br><b>*</b>mówiąc o zadaniach praktyczne mam myśli zadania, w których są stawiane problemy a my musimy napisać kod lub zmodyfikować część kodu aplikacji, który rozwiązuje postawione problemy. Rozwiązywanie takich zadań świetnie pokazuje na ile rozumiemy pewne zagadnienia i może kwalifikować nas do tego czy już nadajemy się na rozpoczęcie pracy jako programista. <br><br> Nie powiedziałem jeszcze o testach typu \"ABCD\" - są dobre ale w kontekście powtórki materiału lub dla osób które chcą robić dodatkowe certyfikaty i czeka ich egzamin.<br> Dodatkowo fajnie gdy kursy czy materiały do nauki kończą się napisaniem większego projektu ćwiczeniowego, który obejmuje dość sporo zagadnień praktycznych. Taki projekt oprócz tego, że sprawdza nasze umiejętności w odnalezieniu się w roli programisty to dodatkowo można go wgrać na GitHub'a a link udostępnić w naszym CV. Co będzie ułatwiało przejście rozmów kwalifikacyjnych.",
    "HowLearnNET_26":"Podejście do praktyki i rekrutacji",
    "HowLearnNET_27":"Po roku intensywnej nauki należałoby postarać się o praktykę w firmie. Dobrze jest trafić do projektu gdzie będziemy mieli szansę pisać kod pod nadzorem doświadczonych programistów. Jednak z tym bywa różnie często zdarza się tak, że dostajemy zadanie nie związane z programowaniem np. testowanie. Dlatego warto pytać na spotkaniu kwalifikacyjnym o nasze przyszłe zadania i możliwości rozwoju. Pamiętajmy rozwój polega na zdobywaniu nowych doświadczeń, które w przyszłości powinny nam dać szanse na lepiej płatną pracę. Również praktyka nie oznacza, że przestajemy uczyć się indywidualnie po godzinach. Uczyć się trzeba cały czas, czy to mając praktykę czy pracując w zawodzie. Taki jest zawód programisty, rozwiązania i technologie zmieniają się i należy za tym nadążyć bo w przeciwnym razie z czasem będzie ciężko o dobrze płatną pracę.",

    "Order_1": "Co zawierają karty ćwiczeniowe?",
    "Order_2": "Karty ćwiczeniowe są w formacie PDF i zawierają:",
    "Order_3": "Część opisowa zagadnienia.",
    "Order_4": "Pytania i odpowiedzi na rozmowę kwalifikacyjną.",
    "Order_5": "Zadanie do napisania w formie projektu/kodu oraz rozwiązanie.",
    "Order_6": "Przykładowa karta ćwiczeń",
    "Order_7": "Jak zamówić karty ćwiczeniowe?",
    "Order_8": "Zamówienie nie wymagania ani rejestracji ani logowania.",
    "Order_9": "Wystarczy wysłać przelew w tytule wpisując adres email, na który będą wysłane karty ćwiczeń oraz nazwę kart ćwiczeń, które chce się zamówić.",
    "Order_10": "Przykładowy tytuł przelewu:",
    "Order_11": "m.kowalski888@gmail.com, C# poziom 1",
    "Order_12": "Realizacja 24h",
    "Order_13": "Czas realziacji 24h od momentu zaksięgowania wpłaty.",
    "Order_14": "Rachunek bankowy dla wpłat:",
    "Order_15": "65 1140 2004 0000 3102 7737 3457",
    "Order_16": "Akceptacja regulaminu",
    "Order_17": "Wysłanie przelewu jest równoznaczne z zakupem i akceptcją",
    "Order_18": "regulaminu",
    "Order_19": "C# i .NET<br>poziom 1",
    "Order_20": "30",
    "Order_21": "PLN",
    "Order_22": "15 tematów",
    "Order_23": "45 stron materiałów",
    "Order_24": "45 pytań na rozmowie kwalifikacyjną",
    "Order_25": "15 zadań praktycznych",
    "Order_26": "tytuł płatności:",
    "Order_27": "twój@email, C# poziom 1",
    "Order_28": "C# i .NET<br>poziom 2",
    "Order_29": "30",
    "Order_30": "PLN",
    "Order_31": "13 tematów",
    "Order_32": "60 stron materiałów",
    "Order_33": "39 pytań na rozmowie kwalifikacyjną",
    "Order_34": "13 zadań praktycznych",
    "Order_35": "tytuł płatności:",
    "Order_36": "twój@email, C# poziom 2",
    "Order_37": "C# i .NET<br>poziom 3",
    "Order_38": "30",
    "Order_39": "PLN",
    "Order_40": "13 tematów",
    "Order_41": "50 stron materiałów",
    "Order_42": "39 pytań na rozmowie kwalifikacyjną",
    "Order_43": "13 zadań praktycznych",
    "Order_44": "tytuł płatności:",
    "Order_45": "twój@email, C# poziom 3"

}